# BuiltInFailures.OffsetFacesCellLegacyFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OffsetFacesCellLegacyFailures Class
BuiltInFailures Class Members See Also
---
Failures related to offset faces operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class OffsetFacesCellLegacyFailures
```

Visual Basic
---
```text
Public NotInheritable Class OffsetFacesCellLegacyFailures
```

Visual C++
---
```text
public ref class OffsetFacesCellLegacyFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..OffsetFacesCellLegacyFailures
# See Also
BuiltInFailures..::..OffsetFacesCellLegacyFailures Members
Autodesk.Revit.DB Namespace